{
  "users": [
    {
      "id": 1,
      "email": "tkomrij@gmail.com",
      "name": "Tatiane Komrij"
    },
    {
      "id": 2,
      "email": "aparvin@gmail.com",
      "name": "Austin Parvin"
    },
    {
      "email": "Joeshep@gmail.com",
      "name": "Joe Shep",
      "id": 3
    }
  ],
  "notes": [
    {
      "note": "Kinda deep and dark for a Disney movie, don’t think it’s for children.",
      "apiMovieId": 508442,
      "userId": 1,
      "id": 1
    },
    {
      "note": "Gal Gadot was amazing, but the plot of the movie was only so-so.",
      "apiMovieId": 464052,
      "userId": 1,
      "id": 2
    },
    {
      "note": "woah",
      "apiMovieId": 458576,
      "userId": 2,
      "id": 3
    }
  ],
  "watchLaterMovies": [
    {
      "id": 1,
      "userId": 2,
      "apiMovieId": 464052,
      "poster_path": "/8UlWHLMpgZm9bx6QYh0NFoq67TZ.jpg",
      "title": "Wonder Woman 1984",
      "overview": "Wonder Woman comes into conflict with the Soviet Union during the Cold War in the 1980s and finds a formidable foe by the name of the Cheetah."
    },
    {
      "id": 2,
      "userId": 1,
      "apiMovieId": 621876,
      "poster_path": "/7yyF1HvQutUyO4GupVCpB9anx14.jpg",
      "title": "Flora & Ulysses",
      "overview": "When Flora rescues a squirrel she names Ulysses, she is amazed to discover he possesses unique superhero powers, which take them on an adventure of humorous complications that ultimately change Flora's life--and her outlook--forever."
    },
    {
      "id": 3,
      "userId": 1,
      "apiMovieId": 614409,
      "poster_path": "/zdkJs9j6yKo9di0kjtctM01fSMv.jpg",
      "title": "To All the Boys: Always and Forever",
      "overview": "Senior year of high school takes center stage as Lara Jean returns from a family trip to Korea and considers her college plans — with and without Peter."
    },
    {
      "id": 4,
      "userId": 1,
      "apiMovieId": 613911,
      "poster_path": "/b7BllsQkD6nTkAdtd28UVCmKqVi.jpg",
      "title": "Bliss",
      "overview": "A mind-bending love story following Greg who, after recently being divorced and then fired, meets the mysterious Isabel, a woman living on the streets and convinced that the polluted, broken world around them is just a computer simulation. Doubtful at first, Greg eventually discovers there may be some truth to Isabel’s wild conspiracy."
    }
  ],
  "favoriteMovies": [
    {
      "id": 1,
      "userId": 2,
      "apiMovieId": 458576,
      "poster_path": "/1UCOF11QCw8kcqvce8LKOO6pimh.jpg",
      "title": "Monster Hunter",
      "overview": "A portal transports Lt. Artemis and an elite unit of soldiers to a strange world where powerful monsters rule with deadly ferocity. Faced with relentless danger, the team encounters a mysterious hunter who may be their only hope to find a way home."
    },
    {
      "id": 2,
      "userId": 1,
      "apiMovieId": 601666,
      "poster_path": "/gKnhEsjNefpKnUdAkn7INzIFLSu.jpg",
      "title": "I Care a Lot",
      "overview": "A court-appointed legal guardian defrauds her older clients and traps them under her care. But her latest mark comes with some unexpected baggage."
    },
    {
      "id": 3,
      "userId": 1,
      "apiMovieId": 583406,
      "poster_path": "/iIgr75GoqFxe1X5Wz9siOODGe9u.jpg",
      "title": "Judas and the Black Messiah",
      "overview": "Bill O'Neal infiltrates the Black Panthers per FBI Agent Mitchell and J. Edgar Hoover. As Black Panther Chairman Fred Hampton ascends, falling for a fellow revolutionary en route, a battle wages for O’Neal’s soul."
    },
    {
      "id": 4,
      "userId": 1,
      "apiMovieId": 602269,
      "poster_path": "/c7VlGCCgM9GZivKSzBgzuOVxQn7.jpg",
      "title": "The Little Things",
      "overview": "Deputy Sheriff Joe \"Deke\" Deacon joins forces with Sgt. Jim Baxter to search for a serial killer who's terrorizing Los Angeles. As they track the culprit, Baxter is unaware that the investigation is dredging up echoes of Deke's past, uncovering disturbing secrets that could threaten more than his case."
    }
  ]
}